Revit 2027 API
Document.LoadFamilySymbol Method
Loads only a specified family type/symbol from a family file into the document.
Overload List
Name | Description
LoadFamilySymbol(String, String) | Loads only a specified family type/symbol from a family file into the document.
LoadFamilySymbol(String, String, FamilySymbol) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
LoadFamilySymbol(String, String, IFamilyLoadOptions, FamilySymbol) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
Top
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace